app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `post_id`, `updated_at`) VALUES ('Teste de comentário...', 'Ythalo Rossy Saldanha Lira', '2013-09-01 03:38:26', 4, '2013-09-01 03:38:26')

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 4 AND `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2