app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post].permit(:title, :text))

    if @post.save
---
INSERT INTO `posts` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2013-08-30 13:54:17', 'This is my first post.', 'First post!', '2013-08-30 13:54:17')

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `title` = 'First post!!!!!!', `updated_at` = '2013-09-01 01:02:42' WHERE `posts`.`id` = 1

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 ORDER BY `posts`.`id` ASC LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1